Tests/sysbench_results_c7a.2xlarge_20250605_134611.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 13:46:11 UTC 2025
Hostname: i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com
Instance Type: c7a.2xlarge
Operating System: Linux i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com 6.1.130-139.222.amzn2023.x86_64 #1 SMP PREEMPT_DYNAMIC Tue Mar 11 01:10:58 UTC 2025 x86_64 x86_64 x86_64 GNU/Linux
CPU Info: AMD EPYC 9R14 AMD EPYC 9R14
CPU Cores: 8
Memory: 15Gi
=====================================================================

[2025-06-05 13:46:11] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 13:46:11] Results will be saved to: sysbench_results_c7a.2xlarge_20250605_134611.txt
[2025-06-05 13:46:11] ================================================
[2025-06-05 13:46:11] Checking prerequisites...
[2025-06-05 13:46:11] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 13:46:11] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 13:46:11] Starting CPU benchmarks...
[2025-06-05 13:46:11] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 13:46:11] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 39125.57 lat (ms,95%): 0.03
[ 20s ] thds: 1 eps: 39526.83 lat (ms,95%): 0.03
[ 30s ] thds: 1 eps: 39980.16 lat (ms,95%): 0.03
[ 40s ] thds: 1 eps: 40780.14 lat (ms,95%): 0.03
[ 50s ] thds: 1 eps: 42175.50 lat (ms,95%): 0.03
[ 60s ] thds: 1 eps: 40197.44 lat (ms,95%): 0.03
[ 70s ] thds: 1 eps: 39264.24 lat (ms,95%): 0.03
[ 80s ] thds: 1 eps: 38959.69 lat (ms,95%): 0.03
[ 90s ] thds: 1 eps: 39138.01 lat (ms,95%): 0.03
[ 100s ] thds: 1 eps: 40964.82 lat (ms,95%): 0.03
[ 110s ] thds: 1 eps: 42488.79 lat (ms,95%): 0.03
CPU speed:
    events per second: 40547.11

Throughput:
    events/s (eps):                      40547.1145
    time elapsed:                        120.0002s
    total number of events:              4865661

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                    0.17
         95th percentile:                        0.03
         sum:                               119510.87

Threads fairness:
    events (avg/stddev):           4865661.0000/0.00
    execution time (avg/stddev):   119.5109/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 13:48:11] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 323363.74 lat (ms,95%): 0.03
[ 20s ] thds: 8 eps: 335159.05 lat (ms,95%): 0.03
[ 30s ] thds: 8 eps: 336342.05 lat (ms,95%): 0.03
[ 40s ] thds: 8 eps: 342626.76 lat (ms,95%): 0.03
[ 50s ] thds: 8 eps: 335429.72 lat (ms,95%): 0.03
[ 60s ] thds: 8 eps: 336010.17 lat (ms,95%): 0.03
[ 70s ] thds: 8 eps: 343728.86 lat (ms,95%): 0.03
[ 80s ] thds: 8 eps: 340405.33 lat (ms,95%): 0.03
[ 90s ] thds: 8 eps: 340759.62 lat (ms,95%): 0.03
[ 100s ] thds: 8 eps: 345728.39 lat (ms,95%): 0.03
[ 110s ] thds: 8 eps: 335661.93 lat (ms,95%): 0.03
CPU speed:
    events per second: 336744.09

Throughput:
    events/s (eps):                      336744.0918
    time elapsed:                        120.0002s
    total number of events:              40409355

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                   26.55
         95th percentile:                        0.03
         sum:                               955216.83

Threads fairness:
    events (avg/stddev):           5051169.3750/39414.14
    execution time (avg/stddev):   119.4021/0.01

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 13:50:11] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 13:50:11] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 13:51:48] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:51:48] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 8917.81 qps: 142693.27 (r/w/o: 124856.85/0.00/17836.42) lat (ms,95%): 0.97 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 8732.70 qps: 139721.96 (r/w/o: 122256.55/0.00/17465.41) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 8216.17 qps: 131458.85 (r/w/o: 115026.51/0.00/16432.34) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 8180.61 qps: 130889.85 (r/w/o: 114528.83/0.00/16361.02) lat (ms,95%): 1.12 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 8238.40 qps: 131814.06 (r/w/o: 115337.15/0.00/16476.91) lat (ms,95%): 1.08 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 8330.00 qps: 133279.78 (r/w/o: 116619.68/0.00/16660.10) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 8407.51 qps: 134521.83 (r/w/o: 117706.80/0.00/16815.03) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 8394.68 qps: 134313.95 (r/w/o: 117524.59/0.00/16789.36) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 8307.81 qps: 132925.44 (r/w/o: 116309.83/0.00/16615.62) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 8285.41 qps: 132567.12 (r/w/o: 115996.31/0.00/16570.82) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 8295.17 qps: 132723.37 (r/w/o: 116133.14/0.00/16590.23) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 8309.19 qps: 132946.76 (r/w/o: 116328.38/0.00/16618.38) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            14086338
        write:                           0
        other:                           2012334
        total:                           16098672
    transactions:                        1006167 (8384.05 per sec.)
    queries:                             16098672 (134144.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8384.0510
    time elapsed:                        120.0096s
    total number of events:              1006167

Latency (ms):
         min:                                    0.74
         avg:                                    0.95
         max:                                   30.70
         95th percentile:                        1.04
         sum:                               959137.13

Threads fairness:
    events (avg/stddev):           125770.8750/1549.68
    execution time (avg/stddev):   119.8921/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:53:48] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1080.04 qps: 6484.26 (r/w/o: 0.00/4323.37/2160.89) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 939.90 qps: 5638.89 (r/w/o: 0.00/3759.09/1879.80) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 452.80 qps: 2717.30 (r/w/o: 0.00/1811.70/905.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1171.20 qps: 7027.22 (r/w/o: 0.00/4684.81/2342.41) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 251.20 qps: 1507.20 (r/w/o: 0.00/1004.80/502.40) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1174.80 qps: 7048.80 (r/w/o: 0.00/4699.20/2349.60) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 265.20 qps: 1590.20 (r/w/o: 0.00/1059.80/530.40) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1198.00 qps: 7189.02 (r/w/o: 0.00/4793.01/2396.01) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 321.60 qps: 1929.59 (r/w/o: 0.00/1286.40/643.20) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1148.00 qps: 6888.02 (r/w/o: 0.00/4592.01/2296.01) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 371.50 qps: 2228.00 (r/w/o: 0.00/1485.00/743.00) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1096.00 qps: 6577.00 (r/w/o: 0.00/4385.00/2192.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           378844
        other:                           189422
        total:                           568266
    transactions:                        94711  (789.12 per sec.)
    queries:                             568266 (4734.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      789.1232
    time elapsed:                        120.0205s
    total number of events:              94711

Latency (ms):
         min:                                    1.35
         avg:                                   10.14
         max:                                  184.17
         95th percentile:                       37.56
         sum:                               959950.68

Threads fairness:
    events (avg/stddev):           11838.8750/0.78
    execution time (avg/stddev):   119.9938/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 13:55:48] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 251.09 qps: 5034.43 (r/w/o: 3525.91/1005.55/502.97) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 442.80 qps: 8858.56 (r/w/o: 6199.74/1773.21/885.61) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 270.00 qps: 5400.00 (r/w/o: 3780.00/1079.90/540.10) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 642.20 qps: 12843.09 (r/w/o: 8990.79/2567.90/1284.40) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 277.40 qps: 5548.89 (r/w/o: 3883.59/1110.50/554.80) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 674.40 qps: 13488.01 (r/w/o: 9441.61/2697.60/1348.80) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 416.70 qps: 8334.01 (r/w/o: 5833.80/1666.80/833.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 371.30 qps: 7426.01 (r/w/o: 5198.20/1485.20/742.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 795.10 qps: 15901.98 (r/w/o: 11131.38/3180.40/1590.20) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 256.80 qps: 5136.00 (r/w/o: 3595.20/1027.20/513.60) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 948.20 qps: 18964.04 (r/w/o: 13274.83/3792.81/1896.40) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 248.10 qps: 4962.00 (r/w/o: 3473.40/992.40/496.20) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            783286
        write:                           223795
        other:                           111899
        total:                           1118980
    transactions:                        55949  (466.14 per sec.)
    queries:                             1118980 (9322.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      466.1439
    time elapsed:                        120.0252s
    total number of events:              55949

Latency (ms):
         min:                                    1.67
         avg:                                   17.16
         max:                                  218.89
         95th percentile:                       38.94
         sum:                               960058.04

Threads fairness:
    events (avg/stddev):           6993.6250/18.58
    execution time (avg/stddev):   120.0073/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 13:57:48] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1465504
        write:                           0
        other:                           0
        total:                           1465504
    transactions:                        1465504 (146535.84 per sec.)
    queries:                             1465504 (146535.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      146535.8354
    time elapsed:                        10.0010s
    total number of events:              1465504

Latency (ms):
         min:                                    0.02
         avg:                                    0.05
         max:                                   82.27
         95th percentile:                        0.09
         sum:                                79759.61

Threads fairness:
    events (avg/stddev):           183188.0000/5111.29
    execution time (avg/stddev):   9.9700/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 13:57:58] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           25411
        other:                           0
        total:                           25411
    transactions:                        25411  (2533.79 per sec.)
    queries:                             25411  (2533.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2533.7919
    time elapsed:                        10.0288s
    total number of events:              25411

Latency (ms):
         min:                                    0.80
         avg:                                    3.15
         max:                                  155.86
         95th percentile:                        3.68
         sum:                                80157.58

Threads fairness:
    events (avg/stddev):           3176.3750/0.48
    execution time (avg/stddev):   10.0197/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 13:58:08] Starting K6 benchmarks...
[2025-06-05 13:58:08] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 13:58:09] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 14874 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m01.0s/10m0s  014883/100000 shared iters

running (00m02.0s), 80/80 VUs, 36437 complete and 0 interrupted iterations
default   [  36% ] 80 VUs  00m02.0s/10m0s  036437/100000 shared iters

running (00m03.0s), 80/80 VUs, 57661 complete and 0 interrupted iterations
default   [  58% ] 80 VUs  00m03.0s/10m0s  057661/100000 shared iters

running (00m04.0s), 80/80 VUs, 79558 complete and 0 interrupted iterations
default   [  80% ] 80 VUs  00m04.0s/10m0s  079558/100000 shared iters
time="2025-06-05T13:58:15Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Teardown cleanup finished." source=console

running (00m04.9s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.9s/10m0s  100000/100000 shared iters


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=6.45ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  20282.607283/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=3.8ms  min=262.75µs med=3.24ms max=275.7ms  p(90)=5.4ms  p(95)=6.45ms
      { endpoint:postgres_insert }..............................................: avg=3.8ms  min=262.75µs med=3.24ms max=275.7ms  p(90)=5.4ms  p(95)=6.45ms
      { expected_response:true }................................................: avg=3.8ms  min=262.75µs med=3.24ms max=275.7ms  p(90)=5.4ms  p(95)=6.45ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 20282.810109/s

    EXECUTION
    iteration_duration..........................................................: avg=3.91ms min=340.68µs med=3.31ms max=280.96ms p(90)=5.61ms p(95)=6.77ms
    iterations..................................................................: 100000 20282.607283/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.9 MB/s
    data_sent...................................................................: 26 MB  5.3 MB/s



running (00m04.9s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.9s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 13:58:15] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T13:58:15Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T13:58:15Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 23060 complete and 0 interrupted iterations
default   [  23% ] 80 VUs  00m01.0s/10m0s  023061/100000 shared iters

running (00m02.0s), 80/80 VUs, 47596 complete and 0 interrupted iterations
default   [  48% ] 80 VUs  00m02.0s/10m0s  047596/100000 shared iters

running (00m03.0s), 80/80 VUs, 72631 complete and 0 interrupted iterations
default   [  73% ] 80 VUs  00m03.0s/10m0s  072631/100000 shared iters

running (00m04.0s), 80/80 VUs, 97638 complete and 0 interrupted iterations
default   [  98% ] 80 VUs  00m04.0s/10m0s  097638/100000 shared iters
time="2025-06-05T13:58:19Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T13:58:19Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=5.93ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  73274.316857/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=3.12ms min=187.91µs med=2.8ms  max=25.78ms p(90)=4.93ms p(95)=5.92ms
      { endpoint:postgres_get }.............................................: avg=3.12ms min=187.91µs med=2.8ms  max=25.78ms p(90)=4.93ms p(95)=5.93ms
      { expected_response:true }............................................: avg=3.12ms min=187.91µs med=2.8ms  max=25.78ms p(90)=4.93ms p(95)=5.92ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 24449.441306/s

    EXECUTION
    iteration_duration......................................................: avg=3.22ms min=232.88µs med=2.87ms max=25.87ms p(90)=5.12ms p(95)=6.15ms
    iterations..............................................................: 100000 24424.772286/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  5.2 MB/s
    data_sent...............................................................: 13 MB  3.1 MB/s



running (00m04.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.0s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 13:58:19] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 2249 complete and 0 interrupted iterations
default   [   2% ] 80 VUs  00m01.0s/10m0s  002249/100000 shared iters

running (00m02.0s), 80/80 VUs, 17723 complete and 0 interrupted iterations
default   [  18% ] 80 VUs  00m02.0s/10m0s  017724/100000 shared iters

running (00m03.0s), 80/80 VUs, 33776 complete and 0 interrupted iterations
default   [  34% ] 80 VUs  00m03.0s/10m0s  033776/100000 shared iters

running (00m04.0s), 80/80 VUs, 50259 complete and 0 interrupted iterations
default   [  50% ] 80 VUs  00m04.0s/10m0s  050259/100000 shared iters

running (00m05.0s), 80/80 VUs, 70034 complete and 0 interrupted iterations
default   [  70% ] 80 VUs  00m05.0s/10m0s  070034/100000 shared iters

running (00m06.0s), 80/80 VUs, 92860 complete and 0 interrupted iterations
default   [  93% ] 80 VUs  00m06.0s/10m0s  092860/100000 shared iters
time="2025-06-05T13:58:25Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=7.67ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  15794.134762/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.92ms min=209.8µs  med=3.91ms max=846.97ms p(90)=6.51ms p(95)=7.67ms
      { endpoint:postgres_insert }..............................................: avg=4.92ms min=209.8µs  med=3.91ms max=846.97ms p(90)=6.51ms p(95)=7.67ms
      { expected_response:true }................................................: avg=4.92ms min=209.8µs  med=3.91ms max=846.97ms p(90)=6.51ms p(95)=7.67ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 15794.292703/s

    EXECUTION
    iteration_duration..........................................................: avg=5.03ms min=247.89µs med=3.98ms max=848.48ms p(90)=6.71ms p(95)=7.95ms
    iterations..................................................................: 100000 15794.134762/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.5 MB/s
    data_sent...................................................................: 26 MB  4.1 MB/s



running (00m06.3s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.3s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 13:58:25] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T13:58:25Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T13:58:25Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 21010 complete and 0 interrupted iterations
default   [  21% ] 80 VUs  00m01.0s/10m0s  021010/100000 shared iters

running (00m02.0s), 80/80 VUs, 45468 complete and 0 interrupted iterations
default   [  45% ] 80 VUs  00m02.0s/10m0s  045468/100000 shared iters

running (00m03.0s), 80/80 VUs, 70346 complete and 0 interrupted iterations
default   [  70% ] 80 VUs  00m03.0s/10m0s  070346/100000 shared iters

running (00m04.0s), 80/80 VUs, 95874 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m04.0s/10m0s  095874/100000 shared iters
time="2025-06-05T13:58:30Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T13:58:30Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=6.08ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  71924.806355/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=3.18ms min=164.22µs med=2.82ms max=26.51ms p(90)=5.07ms p(95)=6.08ms
      { endpoint:postgres_get }.............................................: avg=3.18ms min=164.22µs med=2.83ms max=26.51ms p(90)=5.07ms p(95)=6.08ms
      { expected_response:true }............................................: avg=3.18ms min=164.22µs med=2.82ms max=26.51ms p(90)=5.07ms p(95)=6.08ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 23999.150136/s

    EXECUTION
    iteration_duration......................................................: avg=3.28ms min=213.37µs med=2.89ms max=26.73ms p(90)=5.27ms p(95)=6.34ms
    iterations..............................................................: 100000 23974.935452/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  5.1 MB/s
    data_sent...............................................................: 13 MB  3.1 MB/s



running (00m04.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 13:58:30] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 13:58:30 UTC 2025
Duration: 12 minutes and 19 seconds
Results saved to: sysbench_results_c7a.2xlarge_20250605_134611.txt
=====================================================================
[2025-06-05 13:58:30] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 13:58:30] Detailed results saved to: sysbench_results_c7a.2xlarge_20250605_134611.txt